-- MERGE !!!  not INSERT

MERGE INTO member (id,member_name)
 KEY (id) VALUES
 (1,'Anton')
,(2,'Ivan')
,(3,'Boris')
,(4,'Rebecca')
,(5,'Paula')
,(6,'Johanna')
,(7,'Sacha')
,(8,'Sonia')
,(9,'David')
,(10,'Dimitri')
,(11,'Yanni')
,(12,'Natacha')
;

MERGE INTO pet (id, kind, pet_name, member_id)
    KEY (id) VALUES
 (1, 'кот', 'Васька', 1)
,(2, 'кошка', 'Мурка', 2)
,(3, 'пес', 'Барбос', 3)
,(4, 'кот', 'Парамон', 4)
,(5, 'попугай', 'Сеня', 5)
,(6, 'кошка', 'Маня', 6)
,(7, 'кот', 'Федот', 7)
,(8, 'попугай', 'Федька', 8)
,(9, 'пес', 'Шарик', 9)
,(10, 'енот', 'Петя', 10)
,(11, 'кот', 'Добряк', 1)
,(12, 'кошка', 'Ведьма', 1)
,(13, 'пес', 'Кузя', 2)
,(14, 'кот', 'Кот', 3)
,(15, 'енот', 'Леня', 4)
,(16, 'кот', 'Василий', 4)
,(17, 'кошка', 'Настасья', 5)
,(18, 'питон', 'Петя', 6)
;

